Tutorial_benchmark_1_with_2_interfaces_MPI/constant/transportProperties
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location constant;
    object transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

    transportModel Newtonian;

    nu nu [0 2 -1 0 0 0 0 ] 0.1542;

    //nu nu [0 2 -1 0 0 0 0 ] 0.001; //15.42;//0.001542
    //rho rho [1 -3 0 0 0 0 0] 0.00118;
    //pRef pRef [1 -1 -2 0 0 0 0 ] 1000;
    pRef pRef [1 -1 -2 0 0 0 0 ] 0.0; //By default value . no need to specify explicitly
