Tutorial_benchmark_1_with_2_interfaces_MPI/system/fvSchemes_alter
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
    {
        default backward;
        //default Euler;
    }

    gradSchemes
    {
        default cellLimited Gauss linear 1;
        //default cellMDLimited Gauss linear 1.0;//robust but diffusive
        //default cellMDLimited Gauss linear 0.5;//accurate and stable
    }

    divSchemes
    {
        default         none;
    	div(phi,U)      Gauss linearUpwind grad(U);
        div((nuEff*dev2(T(grad(U))))) Gauss linear;
        //div(phi,U)      Gauss upwind;
        //div((nuEff*dev2(T(grad(U))))) Gauss linear;
    }

    interpolationSchemes
    {
        default linear;
    }

    laplacianSchemes
    {
        default Gauss linear corrected;
    }

    snGradSchemes
    {
        default corrected;

    }

    /*
    snGradSchemes
    {
        //default corrected;
        default limited corrected 0.5;
        //default limited 0.5; //on non-orthogonal meshes
    }

    laplacianSchemes
    {
        //default Gauss linear corrected;
        default Gauss linear limited corrected 0.5;
        //default Gauss linear limited 0.5; //On Non-orthogonal meshes
    }

    wallDist
    {
        method meshWave;
    }

    fluxRequired
    {
        default no;
        p ;
        Phi ;
    }*/
