Tutorial_benchmark_1_with_2_interfaces_MPI/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        tolerance        1e-6;
        relTol           1e-5;
        smoother         DICGaussSeidel;
    }

    /*
    p
    {
        solver           PCG;
        tolerance        1e-5;
        relTol           0.01;
        preconditioner         DIC;
    }*/


    pFinal
    {
        $p;
        tolerance       1e-07;
        relTol          0;
    }

    pcorr
    {
        solver           GAMG;
        tolerance        1e-5;
        relTol           1e-4;
        smoother         GaussSeidel;
    }

    pcorrFinal
    {
        $pcorr;
        relTol          0;
    }

    phi
    {
        $p;
    }

    "(U|cellDisplacement)"
    {
        /*
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-08;
        relTol          0;
        */

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          1e-6;
    }

    "(U|cellDisplacement)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    nOuterCorrectors 5;//2,5
    nCorrectors 2;//2,2
    nNonOrthogonalCorrectors 5;//5,5
    tolerance 1.0e-5;
    relTol 0.01;

    correctPhi          yes;

    consistent  true;

    relaxationFactors
    {
        fields
        {
            p       0.3;//0.4
            pFinal  1.0;//0.4
            pcorr       0.3;//0.3
            pcorrFinal  1.0;//0.4
        }
        equations
        {
            U       0.7;//0.6
            UFinal  1.0;//0.6
        }
    }

    // OpenFOAM 6 (.org) or newer
    residualControl
    {
        U 1e-5;
        p 1e-5;
        pcorr 1e-5;
    }

}

PISO
{
    nNonOrthogonalCorrectors 5;//10
}
potentialFlow
{
    nNonOrthogonalCorrectors 5;//10
}


// ************************************************************************* //